# -*- coding: utf-8 -*-

# 1. Приветствие
helloText = '''Привет!
Некоторые могут подумать, что я созданный человеком робот, но это не совсем так (только договоримся держать это в секрете!)
Двуногие, кстати, скидку дают всем, кто дружит со мной 😎
'''

# 2. Возможности
abilitiesText = '''Смотри, что я умею!
• Забронирую стол.
• Покажу меню.
• Поздравлю с Днем рождения и от себя лично подарю подарок 🎁
• Передам твои предложения, отзывы и идеи руководству. Если тебе что-то не понравилось, я тоже об этом сообщу.
• Покажу наши профили в социальных сетях.
• С радостью познакомлюсь с твоими друзьями.
• Покажу, как к нам добраться.
• По секрету предупрежу о мастер-классах, дегустациях или тусовках.
• Иногда просто расскажу парочку историй
'''
    
# 3. Акции
discountsText = '''А вот и акции:
• 20% на День рождения.
• 10% за фотографию в Instagram с отметкой нашего заведения @nasvyazimsk ! Твой снимок обязательно повесим на нашу доску почета!
'''

# 4. День рождения
birthdayText = '''А у кого-то сегодня праздник, не знаешь таких?) Поздравляю тебя с новыми цифрами.
Покажи это сообщение двуногим, и тебе подарок от меня: 20% скидка на все меню, у тебя неделя 😎
Будем «На Связи»!
'''

# 5. Анкета
startFormText = 'Может для начала познакомимся поближе?'
existUser = 'Кажется, ты уже заполнял анкету.\nТы '

formName = 'Расскажи мне о себе! Как к тебе обращаться?'
formBDay = 'Когда у тебя День рождения?\nНапиши в формате dd.mm'
formPhone = 'Ок, я запомнил! А номер у тебя какой?'
formConfirmation = '''Давай проверим, все ли правильно?
Если нашел ошибку, то отправь мне номер строки, которую нужно исправить и как.
К примеру, чтобы исправить имя, нужно написать так:
1. Новое Имя
'''
formEdit = '''Напиши номер строки, которую надо исправить и как.
Например, чтобы исправить имя, нужно написать так:
1. Новое Имя'''
formCheck = '''Проверь сообщение с информацией о себе еще раз, я его отредактировал!
Все ок? - Жми на кнопку! Если нужно что-то исправить, пиши в том же формате (1. Новое Имя)'''
formTryAgain = 'Попробуй еще раз.'
startFormText = 'В общем, нажимай на кнопку, будем знакомы 🤝'
existUser = 'Кажется, ты уже заполнял анкету.\nТы '

# 6. Бронь
bookingRequest = '''Напиши в одном сообщении, когда тебя ждать (время и дата) и сколько будет человек.
Если хочешь забронировать стол на другой номер или на другое имя, напиши об этом в том же сообщении!'''
bookingWait = 'Сейчас двуногие закончат танцевать от радости и сразу тебе перезвонят 😀'

# 7. Ссылки
networksText = 'Нажми на кнопку, чтобы перейти'
contactsText = 'По всем вопросам обращайся по телeфону +7 (915) 384 78-78'

# 8. Как пройти
mapText = '''Наше заведение находится в пешей доступности от м. Китай-город по адресу ул. Маросейка, 7/8.
Вход через арку со стороны Большого Златоустинского переулка.
Если ты добираешься на автомобиле, то путь объезда прикреплен ниже.
Во дворе ориентиром для тебя будет деревянная дверь. Набирай на домофоне 2В и поднимайся на 2 этаж.'''

# 9. Поделиться с другом
sendFriendText = 'Нажми, чтобы выбрать чат с другом'
friendText = '''Привет, друг! Welcome to @NaSvyaziMskbot
Это бот кальян-бара «На связи», где ты можешь забронировать столик, посмотреть меню кальянов и напитков, спросить, как добраться, и узнать про акции и скидки
Присоединяйся :)'''
# 10. Оценка и отзыв
networksText = 'Нажми на кнопку, чтобы перейти'
rateText = 'Отправь мне только число. Нецелые числа пиши через точку. Или выбери оценку ниже ↓'
commentText = 'Отправь одним сообщением, что передать руководству'

# 11. Прочее
menuText = 'Выберите меню'
reviewText = 'Выбери способ'
formatText = 'Ответь в нужном формате 👆🏼'
